---
title: 在图上做随机游走
tags: [ONgDB]
author: Yc-Ma
show_author_profile: true
key: 2020-07-24-在图上做随机游走
pageview: true
---

Here's the table of contents:
1. TOC
{:toc}

## 随机游走

### Graph Demo
```
CREATE  (home:Page {name: 'Home'}), (about:Page {name: 'About'}), (product:Page {name: 'Product'}), (links:Page {name: 'Links'}), (a:Page {name: 'Site A'}), (b:Page {name: 'Site B'}), (c:Page {name: 'Site C'}), (d:Page {name: 'Site D'}), (home)-[:LINKS]->(about), (about)-[:LINKS]->(home), (product)-[:LINKS]->(home), (home)-[:LINKS]->(product), (links)-[:LINKS]->(home), (home)-[:LINKS]->(links), (links)-[:LINKS]->(a), (a)-[:LINKS]->(home), (links)-[:LINKS]->(b), (b)-[:LINKS]->(home), (links)-[:LINKS]->(c), (c)-[:LINKS]->(home), (links)-[:LINKS]->(d), (d)-[:LINKS]->(home)
```

### Random Walk-1
-
- steps 表示随机游走路径包含多少步
- walks 表示需要返回多少条游走路径
```
MATCH (home:Page {name: 'Home'})
CALL gds.alpha.randomWalk.stream({nodeProjection:'*',relationshipProjection:{LINKS: {type:'LINKS',projection:'UNDIRECTED'}},start: id(home),steps: 3,walks: 1 }) YIELD nodeIds
UNWIND nodeIds AS nodeId RETURN gds.util.asNode(nodeId).name AS page
```
```
╒═════════╕
│"page"   │
╞═════════╡
│"Home"   │
├─────────┤
│"Product"│
├─────────┤
│"Home"   │
├─────────┤
│"About"  │
└─────────┘
```
### Random Walk-2
- nodeQuery 用于查找符合条件的节点cypher语句
- relationshipQuery 用于查找符合条件的边的cypher语句
```
MATCH (home:Page {name:'Home'})
 CALL gds.alpha.randomWalk.stream({nodeQuery:'MATCH (p:Page) RETURN id(p) AS id',relationshipQuery: 'MATCH (p1:Page)-[:LINKS]->(p2:Page) RETURN id(p1) AS source, id(p2) AS target',start: id(home),steps: 5,walks: 1 }) YIELD nodeIds
 UNWIND nodeIds AS nodeId RETURN gds.util.asNode(nodeId).name AS page
```
```
╒═══════╕
│"page" │
╞═══════╡
│"Home" │
├───────┤
│"About"│
├───────┤
│"Home" │
├───────┤
│"Links"│
├───────┤
│"Home" │
├───────┤
│"Links"│
└───────┘
```

