---
title: 股权网络弱连通子图分析
tags: [ONgDB,Cypher,Neo4j]
author: Yc-Ma
show_author_profile: true
key: 2021-05-28-股权网络弱连通子图分析
pageview: true
---

Here's the table of contents:
1. TOC
{:toc}

## 弱连通子图分析过程
- WCC【弱连通分量计算】
```
CALL algo.unionFind.stream('HORGShareHoldV002','持股',{concurrency:8}) YIELD nodeId,setId
RETURN nodeId,algo.asNode(nodeId).name AS name,setId
```
- WCC【弱连通分量计算】并找到最大团
```
CALL algo.unionFind.stream('HORGShareHoldV002','持股',{concurrency:8}) YIELD nodeId,setId
WITH nodeId,algo.asNode(nodeId).name AS name,setId
WITH COLLECT(setId) AS setIdList
RETURN apoc.coll.sortMaps(apoc.coll.frequencies(setIdList),'count') AS sortMaps
```

## 弱连通子图分析结果
- 最大团

- 最小团

## 在超大团上执行一百层路径穿透测试
### 案例一【返回开始结束节点数据】
- 入参
```
{
    "statements": [
        {
            "statement": "MATCH p=(n:HORGShareHoldV002)<-[r:`持股`*100]-(m) WHERE n.name='北京天星资本股份有限公司' RETURN n,m SKIP 1000000 LIMIT 1",
            "resultDataContents": [
              "graph"
            ]
        }
    ]
}
```
- 结果
```
1：
2：
3：
4：
5：
```
### 案例二【返回全部数据】
- 入参
```
{
    "statements": [
        {
            "statement": "MATCH p=(n:HORGShareHoldV002)<-[r:`持股`*100]-(m) WHERE n.name='北京天星资本股份有限公司' RETURN p SKIP 1000000 LIMIT 1",
            "resultDataContents": [
              "graph"
            ]
        }
    ]
}
```
- 结果
```
1：
2：
3：
4：
5：
```


